# FloorRecreateFailedWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..FloorRecreateFailedWarning Property
BuiltInFailures..::..MassFailures Class See Also
---
The floor cannot be created because no suitable level in the target document can be found.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorRecreateFailedWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorRecreateFailedWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorRecreateFailedWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace